package onboarding;

import java.util.List;

/* memoir
안녕하세요. 우테코 사전교육에 참여한 구수한 이라고 합니다. 사전과제를 받아보고 슬랙에 올라오는 피드를 보면서,
제가 아직 우테코 사전교육을 받을만한 준비가 아직 되지 않았다는 것을 깨달았습니다.

자바를 처음 접할 뿐만 아니라 다른 언어에 대한 이해가 아주 미천한 상태거든요.
그냥 할 수 있다는 의지 만으로 될수 있는게 아니라는 것을 뼈저리게 느꼈고,
공부를 열심히 해야겠다는 것 또한 느꼈습니다.

어떤 부분을 중점적으로 공부해야 할지에 대한 힌트를 얻었다는 점에서,
그리고 저와 비슷한 상황의 (그러나 여러발 앞서 있는)동료들을 볼 수 있었다는 점에서
우테코 5기에 지원서를 내고 우테코 사전교육에 함께하길 정말 잘 했다고 생각합니다.

지난 일주일동안 저는 깃과 깃헙에 대해 공부하였고, 자바의 기초에 대해 - 이해가 안가는 부분이 훨씬 많지만 -
공부할 수 있었습니다. 슬랙 커뮤니티에 올라오는 수많은 질문들을 보며, 내가 뭘 모르는지도 모른다는 것을 깨달았습니다.

앞으로 저는 자바의 기초를 좀 더 다지고, 자바에 대한 이해가 조금 더 생겼을 때 이 문제들을 다시 풀어볼 생각입니다.

그때 또한번, 우테코 5기에 지원해보길 잘 했다라는 소회를 남길 수 있게 열심히 공부하고 활용하겠습니다.

저같이 많이 모자란 사람에게도 기회를 주셔서 감사하고, 우테코와 우아한 형제들의 성공적인 앞날을 기원하겠습니다.

이 글을 읽어 보실지 모르겠지만, 제 느낀점을 기록하는 차원에서 (그리고 github commit 연습도 할겸) 남겨봅니다.

감사합니다.

구 수 한
 */
class Problem1 {
    public static int solution(List<Integer> pobi, List<Integer> crong) {
        int answer = Integer.MAX_VALUE;
        return answer;
    }
}